enthalpyBased_tou0.00005_frictionFactor0.005_NSCBC2/constant/thermophysicalProperties.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hRefpropLiq;//hConst; //hRefpropLiq;
    equationOfState RefpropLiq;  //perfectFluid;   //rho = ( 1./RT)*p + rho0
    specie          specie;
    energy          sensibleEnthalpy;  // not absolute internal energy which takes Hf into account
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   44.01;
    }
    equationOfState
    {
        //R           3000;
        //rho0        1027;
    	Tc 304.13;
    	Vc 0.0021386;
    	Pc 7377300;
    	omega 0.22394;
    
    }
    thermodynamics
    {
        Cp          4195;
        Hf          0;
    }
    transport
    {
        mu          3.645e-4;
        Pr          2.289;
    }
}


// ************************************************************************* //
